Repository: Dahub/DaOAuthV2
Catalog: DaOAuthV2.Service/Resources/Error.*.resx
Languages: fr_fr

# AccessDenied
source: User has denied access to the client
fr_fr: L'utilisateur a refusé l'accès au client

# AskTokenInvalidClient
source: Invalid client
fr_fr: Client invalide

# AskTokenInvalidGrant
source: Invalid code
fr_fr: Code invalide

# AuthorizeClientIdParameterMandatory
source: client_id is mandatory
fr_fr: La paramètre client_id doit être renseigné

# AuthorizeResponseTypeParameterMandatory
source: response_type is mandatory
fr_fr: Le paramètre response_type doit être renseigné

# AuthorizeUnsupportedResponseType
source: response_type should be code or token
fr_fr: response_type doit avoir la valeur code ou token

# ClientIdParameterError
source: Client id parameter mandatory
fr_fr: Le paramètre client id est obligatoire

# CodeParameterError
source: Code parameter must be define
fr_fr: Le paramètre code doit être renseigné

# CreateRessourceServerEmptyScopeWording
source: Scope wording is null
fr_fr: Un scope a un libellé vide

# CreateRessourceServerExistingLogin
source: Login already used
fr_fr: Login déjà utlisé

# CreateRessourceServerExistingScope
source: Scope already exist
fr_fr: Scope déjà existant

# CreateRessourceServerInvalidUserName
source: User don't exist or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# CreateRessourceServerMultipleScopeWording
source: Multiple scopes wording find
fr_fr: Libellés de scope dupliqués détectés

# CreateRessourceServerNonAdminUserName
source: User isn't admin
fr_fr: L'utilisateur n'est pas administrateur

# CreateRessourceServerPasswordDontMatch
source: Passwords don't match
fr_fr: Les deux mots de passe fournis ne correspondent pas

# CreateRessourceServerPasswordPolicyFailed
source: Password don't match policy
fr_fr: Le mot de passe ne rempli pas les critères requis

# CreateReturnUrlBadUserNameOrClientId
source: User and client aren't linked
fr_fr: L'utilisateur n'est pas relié au client

# CreateReturnUrlInvalidClient
source: Invalid or non existing client
fr_fr: Client invalide ou inconnu

# CreateReturnUrlInvalidUser
source: Invalid or non existing user
fr_fr: Utilisateur invalide ou inconnu

# CreateReturnUrlReturnUrlIncorrect
source: Incorrect return url
fr_fr: L'url de redirection est incorrecte

# CreateUserClientClientAlreadyRegister
source: Client already register
fr_fr: Le client est déjà existant

# CreateUserClientInvalidClientPublicId
source: Client don't exist or ban
fr_fr: Le client n'existe pas ou est bloqué

# CreateUserClientInvalidUserName
source: User don't exist or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# CreateUserEmailExists
source: Email address {0} already in use
fr_fr: L'adresse email {0} existe déjà

# CreateUserPasswordDontMatch
source: Passwords don't match
fr_fr: Les deux mots de passe fournis ne correspondent pas

# CreateUserPasswordPolicyFailed
source: Password don't match policy
fr_fr: Le mot de passe ne rempli pas les critères requis

# CreateUserUserNameExists
source: User name {0} already in use
fr_fr: Le nom d'utilisateur {0} existe déjà

# DeleteClientInvalidUserName
source: User invalid or ban
fr_fr: Utilisateur invalide

# DeleteClientUnknowClient
source: Unknow client
fr_fr: Client inconnu

# DeleteClientWrongUser
source: Client don't belong to user, or user isn't client creator
fr_fr: Le client n'appartient pas à l'utilisateur ou ce dernier n'en est pas le créateur

# DeleteRessourceServerInvalidUserName
source: User invalid or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# DeleteRessourceServerNonAdminUserName
source: User don't have right to do this action
fr_fr: L'utilisateur ne possède pas les droits d'effectuer cette action

# DeleteRessourceServerRessourceServerNotFound
source: Can not find ressource server
fr_fr: Impossible de trouver le ressource server

# DeleteReturnUrlBadUserNameOrClientId
source: User and client aren't linked
fr_fr: L'utilisateur n'est pas relié au client

# DeleteReturnUrlInvalidUser
source: Invalid or non existing user
fr_fr: Utilisateur invalide ou inconnu

# DeleteReturnUrlUnknowReturnUrl
source: Cannot find return url
fr_fr: Aucun url de redirection correspondant trouvée

# DeleteUserNoUserFound
source: User don't exist
fr_fr: L'utilisateur n'existe pas

# ModelNull
source: Cannot validate a null object
fr_fr: Impossible de valider un objet null

# PasswordParameterError
source: Password is mandatory
fr_fr: Le paramètre password est obligatoire

# RefreshTokenInvalid
source: Invalid refresh token
fr_fr: Refresh token invalide

# RefreshTokenParameterError
source: Refresh token is mandatory
fr_fr: Le paramètre refresh token est obligatoire

# ReturnUrlParameterError
source: Return url missing or invalid
fr_fr: Le paramètre url de retour est manquant ou contient une url non valide

# SearchClientAskTooMuch
source: You cannot ask for more than 50 results
fr_fr: Vous ne pouvez demander plus de 50 résultats

# SearchClientInvalidUser
source: User don't exist or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# SearchRessourceServerAskTooMuch
source: You cannot ask for more than 50 results
fr_fr: Vous ne pouvez demander plus de 50 résultats

# UnauthorizedClient
source: Client isn't authorized
fr_fr: Le client ne possède pas l'authorisation

source: Unauthorized scope
fr_fr: Scope non authorisés

source: Unsupported grant type
fr_fr: Grant type inconnu

# UpdateRessourceServerInvalidUserName
source: User invalid or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# UpdateRessourceServerNonAdminUserName
source: User don't have right to do this action
fr_fr: L'utilisateur ne possède pas les droits d'effectuer cette action

# UpdateRessourceServerRessourceServerNotFound
source: Can not find ressource server
fr_fr: Impossible de trouver le ressource server

# UpdateReturnUrlBadUserNameOrClientId
source: User and client aren't linked
fr_fr: L'utilisateur n'est pas relié au client

# UpdateReturnUrlInvalidUser
source: Invalid or non existing user
fr_fr: Utilisateur invalide ou inconnu

# UpdateReturnUrlReturnUrlIncorrect
source: Incorrect return url
fr_fr: L'url de redirection est incorrecte

# UpdateReturnUrlUnknowReturnUrl
source: Cannot find return url
fr_fr: Aucun url de redirection correspondant trouvée

# UpdateUserClientClientNotValid
source: User not valid
fr_fr: Client invalide

# UpdateUserClientUserNotValid
source: Client not valid
fr_fr: Utilisateur invalide

# UpdateUserClientUserOrClientNotFound
source: There is no link between this client and this user
fr_fr: Aucun lien entre cet utilisateur et ce client

# UpdateUserNoUserFound
source: User don't exist or ban
fr_fr: L'utilisateur n'existe pas ou est bloqué

# UserCredentialsIncorrects
source: User name or password incorrects
fr_fr: User name ou password incorrects

# UserNameParameterError
source: User name is mandatory
fr_fr: Le paramètre user name est obligatoire
